In [62]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression
import warnings

In [63]:
warnings.filterwarnings('ignore')

In [64]:
df = pd.read_csv('homeprices.csv')

In [65]:
df.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [66]:
import math
bedrooms = math.floor(df.bedrooms.median())
bedrooms

4

In [67]:
df = df.fillna(bedrooms)

In [68]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [69]:
model = LinearRegression()

In [70]:
train = df.drop('price',axis=1)
test = df['price']

In [71]:
model.fit(train,test)

LinearRegression()

In [72]:
model.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [73]:
model.intercept_

221323.0018654043

In [74]:
model.predict([[3000,3,15]])

array([579201.19929613])

In [75]:
model.predict([[2500,4,5]])

array([578876.03748933])

exercise: multiple linear regression

In [76]:
hire = pd.read_csv('hiring.csv')

In [77]:
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [78]:
import math
median_testscore = math.floor(hire['test_score(out of 10)'].median())

hire['test_score(out of 10)']=hire['test_score(out of 10)'].fillna(median_testscore)

In [79]:
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [82]:
hire['experience'] = hire['experience'].fillna(0)

In [84]:
hire['experience'][0]

0

In [86]:
def word2num(df):
    for i in range(0,len(df)):
        temp = df['experience'][i]
        if temp=='seven':
            temp=7
        elif temp=='two':
            temp=2
        elif temp=='three':
            temp=3
        elif temp=='ten':
            temp=10
        elif temp=='eleven':
            temp=11
        temp = df['experience'][i] = temp

SyntaxError: invalid syntax (1977223599.py, line 6)